tests/test_Echo_POST/data

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header />
<soap:Body>
<m:EchoRequest xmlns:m="http://thoughtress.com">
<foo>bar</foo>
<baz>boo</baz>
</m:EchoRequest>
</soap:Body>
</soap:Envelope>